# while True:
#     try:
#         number = int(input("Введіть число:"))
#         break
#     except ValueError:
#         # 4. Сюди ми потрапляємо при помилці
#         print("Це не число")


# print("Запуск калькулятора...")

# while True:
#     try:
#         # 1. Запитуємо дані
#         a = float(input("Перше число: "))
#         action = input("Дія (+, -, *, /): ")
#         b = float(input("Друге число: "))
#         # 2. Рахуємо
#         if action == "+":
#             print(f"Результат: {a + b}")

#         elif action == "-":
#             print(f"Результат: {a - b}")
#         elif action == "*":
#             print(f"Результат: {a * b}")
#         elif action == "/":
#             print(f"Результат: {a / b}")
#         else:
#             print("Я не знаю такої дії!")
#     # 3. Ловимо помилки
#     except ValueError:
#         print("🛑 ПОМИЛКА: Ти ввела літери замість цифр!")

#     except ZeroDivisionError:
#         print("🛑 ПОМИЛКА: На нуль ділити не можна!")

#     # 4. Питаємо про вихід
#     check = input("Напиши 'stop' щоб вийти, або Enter щоб продовжити: ")
#     if check == "stop":
#         break


