# # Верхня половина (звужується)
# a = []
# for i in range(5, 0, -1):
#     a.append(" " * (5 - i) + "*" * (2 * i - 1))

# # Середина
# a.append(" " * 4 + "*")

# # Нижня половина (розширюється)
# for i in range(1, 6):
#     a.append(" " * (5 - i) + "*" * (2 * i - 1))

# # Виведення всіх рядків
# for row in a:
#     print(row)


# Ромб
# a = []
# n = 3

# # Верхня половина (звужується)
# for i in range(n, 0, -1):
#     a.append(" " * (n - i) + "@" + "  @" * (i - 1))
# print("\n".join(a))
# Ромб
a = []
n = 3

# Верхня половина (звужується)
for i in range(n, 1, -1):
    a.append(" " * (n - i) + "@" + "  @" * (i - 1))
    a.append(" " * (n + i) + "  " + "  " * (i + 2))

# Нижня половина (розширюється)
# for i in range(1, n + 1):
#     a.append("  " * (n - i) + "@" + "  @" * (i - 1))

# Виведення всіх рядків
for row in a:
    print(row)
